package data

// Стартовое сообщение при команде /start

var StartMessage = `
Привет, котик ❤️. 
Нажимай кнопочки из меню и поднимай себе настроение: 

/compliments (или ❤️) — команда для получения комплимента (ты, кстати, сегодня классно выглядишь). 

/motivations (или ✨) — команда для поднятия мотивации (твои мечты обязательно сбудутся). 

/dreams (или 💫) -- команда, где будут мои влажные мечты (у меня пубертат). 

/sad (или 😢) -- команда для моих грустинок (прости за перепады).

Я буду обновлять бота, но пока все так.

Твой Марк Б. 💋
`

// Список комплиментов

var Compliments = []string{
	"Ты самая красивая ❤️💋",
	"Ты самая умная ❤️💋",
	"Ты самая сильная ❤️💋",
	"У тебя самые красивые глаза ❤️💋",
	"У тебя самые сочные губы ❤️💋",
	"Ты самая сексуальная ❤️💋",
	"Ты самая желанная ❤️💋",
	"Я теку от тебя ❤️💋",
	"Ты мой никотин ❤️💋",
	"У тебя самый сочный зад ❤️💋",
	"У тебя самая вкусная фигура ❤️💋",
	"Ты лучшая мама на свете ❤️💋",
	"У тебя самая очаровательная улыбка ❤️💋",
	"Ты прекрасна ❤️💋",
	"Ты лучший тимейт ❤️💋",
	"Ты очень талантливая ❤️💋",
	"Ты мое вдохновение ❤️💋",
	"Ты лучшая девушка на свете ❤️💋",
	"Ты делаешь этот мир лучше ❤️💋",
	"Потрясающе выглядишь ❤️💋",
	"Ты бесподобна ❤️💋",
	"Ты мне нравишься ❤️💋",
	"Ты моя муза ❤️💋",
	"Я счастлив с тобой ❤️💋",
	"Ты идеальна ❤️💋",
}

// Список вдохновляющий сообщений

var Motivations = []string{
	"У тебя всё получится ✨",
	"Не сомневайся в себе - ты прекрасна ✨",
	"Ты сильнее, чем думаешь ✨",
	"Ты все сможешь ✨",
	"Твои мечты обязательно сбудутся ✨",
	"Продолжай двигаться вперед ✨",
	"Ты делаешь обычные дни особенными ✨",
	"Никода не сдавайся ✨",
	"Тебе горы по плечу ✨",
	"Выше нос, котенок ✨",
	"Ты заслуживаешь всего самого лучшего ✨",
	"В мире есть ты, а значит, в нём есть что-то прекрасное ✨",
	"Всё будет хорошо, я в тебя верю ✨",
	"Ты делаешь этот мир лучше просто тем, что ты в нём есть ✨",
	"Не принимай всё близко к сердцу, ты ценнее любых проблем ✨",
	"Не сомневайся в себе, ты выбрала верный путь ✨",
	"Ты рождена, чтобы сиять — не позволя никому затмевать твой свет ✨",
	"Пробуй, даже если страшно. Я буду болеть за тебя ✨",
	"Я твой самый большой фанат ✨",
	"Горжусь тобой, просто потому что ты есть ✨",
	"Ты умница ✨",
}

// Список желаний

var Dreams = []string{
	"Хочу поцеловать тебя 💫",
	"Хочу тебя 💫",
	"Хочу стать твоим стулом 💫",
	"Хочу чтобы ты на меня села 💫",
	"Хочу тебе отлизать 💫",
	"Хочу твое милое фото 💫",
	"Хочу фото твоих ножек 💫",
	"Хочу фото твоей сочной попы 💫",
	"Хочу тебя раком 💫",
	"Хочу быть с тобой 💫",
	"Хочу стать лучше для тебя 💫",
}

// Список грустных сообщений

var Sad = []string{
	"Не хочу докучать тебе 😢",
	"Не хочу портить тебе настроение 😢",
	"Боюсь сделать тебе плохо 😢",
	"Боюсь потерять тебя 😢",
	"Боюсь надоесть тебе 😢",
}
